/* No comment provided by engineer. */
"%1.0f days ago" = "%1.0f วันที่แล้ว";

/* No comment provided by engineer. */
"%1.0f hours ago" = "%1.0f ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"%1.0f minutes ago" = "%1.0f นาทีที่แล้ว";

/* No comment provided by engineer. */
"%1.0f months ago" = "%1.0f เดือนที่แล้ว";

/* No comment provided by engineer. */
"%1.0f seconds ago" = "%1.0f วินาทีที่แล้ว";

/* No comment provided by engineer. */
"%1.0f weeks ago" = "%1.0f สัปดาห์ที่แล้ว";

/* No comment provided by engineer. */
"%1.0f years ago" = "%1.0f ปีที่แล้ว";

/* No comment provided by engineer. */
"A minute ago" = "หนึ่งนาทีที่แล้ว";

/* No comment provided by engineer. */
"An hour ago" = "หนึ่งชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Just now" = "เมื่อครู่นี้";

/* No comment provided by engineer. */
"Last month" = "เดือนที่แล้ว";

/* No comment provided by engineer. */
"Last week" = "สัปดาห์ที่แล้ว";

/* No comment provided by engineer. */
"Last year" = "ปีที่แล้ว";

/* No comment provided by engineer. */
"Yesterday" = "เมื่อวาน";

/* No comment provided by engineer. */
"1 year ago" = "1 ปีที่แล้ว";

/* No comment provided by engineer. */
"1 month ago" = "1 เดือนที่แล้ว";

/* No comment provided by engineer. */
"1 week ago" = "1 สัปดาห์ที่แล้ว";

/* No comment provided by engineer. */
"1 day ago" = "1 วันที่แล้ว";

/* No comment provided by engineer. */
"This morning" = "เมื่อเช้านี้";

/* No comment provided by engineer. */
"This afternoon" = "เมื่อบ่ายนี้";

/* No comment provided by engineer. */
"Today" = "วันนี้";

/* No comment provided by engineer. */
"This week" = "สัปดาห์นี้";

/* No comment provided by engineer. */
"This month" = "เดือนนี้";

/* No comment provided by engineer. */
"This year" = "ปีนี้";
